In [1]:
import csv, sqlite3

con = sqlite3.connect("SpaceX.db")
cur = con.cursor()

In [2]:
#this simple step creates the SPACEX table in db

In [3]:
import pandas as pd
df = pd.read_csv(r"C:\Users\infop\OneDrive\Desktop\ML_lab screenshots\spacex_final_dataset.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

168

In [4]:
%load_ext sql

In [5]:
%sql sqlite:///SpaceX.db

In [6]:
#find all names of unique launch sites in set
%sql SELECT Distinct(LaunchSite) FROM SPACEXTBL;

 * sqlite:///SpaceX.db
Done.

[('Cape Canaveral',), ('Vandenberg AF Base',), ('Kennedy Space Center',)]

In [18]:
#find 5 records with launch sites starting with "CCA"
%sql SELECT * FROM SPACEXTBL\
    WHERE LaunchSite LIKE 'Cape Canaveral' LIMIT 5;

 * sqlite:///SpaceX.db
Done.

[(6, '2010-06-04', 'SpaceX', 'Falcon 9', 'F9 v1.0 ', 'Dragon Spacecraft Qualification Unit', 8191, 'Cape Canaveral', 'LEO', 1, 0, 0, 0, 0, -80.577366, 28.5618571, 'Failure (None)', 'Failure', 0.0, 0, 1),
 (8, '2012-05-22', 'NASA', 'Falcon 9', 'F9 v1.0 ', 'SpaceX COTS Demo Flight 2', 525, 'Cape Canaveral', 'LEO', 1, 0, 0, 0, 0, -80.577366, 28.5618571, 'Failure (None)', 'No attempt\n', 0.0, 0, 1),
 (10, '2013-03-01', 'NASA', 'Falcon 9', 'F9 v1.0 ', 'SpaceX CRS-2', 677, 'Cape Canaveral', 'ISS', 1, 0, 0, 0, 0, -80.577366, 28.5618571, 'Failure (None)', 'No attempt\n', 0.0, 0, 1),
 (12, '2013-12-03', 'SES', 'Falcon 9', 'F9 v1.1', 'SES-8', 3170, 'Cape Canaveral', 'GTO', 1, 0, 0, 0, 0, -80.577366, 28.5618571, 'Failure (None)', 'No attempt', 0.0, 0, 1),
 (13, '2014-01-06', 'Thaicom', 'Falcon 9', 'F9 v1.1', 'Thaicom 6', 3325, 'Cape Canaveral', 'GTO', 1, 0, 0, 0, 0, -80.577366, 28.5618571, 'Failure (None)', 'No attempt', 0.0, 0, 1)]

In [8]:
#Calculate the total payload mass carried for NASA
%sql SELECT sum(PayloadMass) FROM SPACEXTBL\
    WHERE Customer = 'NASA';

 * sqlite:///SpaceX.db
Done.

[(157093,)]

In [9]:
#Calculate average payload mass by booster version 'F9 v1.1'
%sql SELECT avg(PayloadMass) FROM SPACEXTBL\
    WHERE Version_Booster = 'F9 v1.1';

 * sqlite:///SpaceX.db
Done.

[(2928.4,)]

In [20]:
#Find the earliest date that a ground landing was successful
%sql SELECT min(Date) FROM SPACEXTBL\
    WHERE Outcome = 'Success (Ground Pad)';

 * sqlite:///SpaceX.db
Done.

[('2015-12-22',)]

In [11]:
#List the names of boosters which have successfully landed on drone ship and had payload mass greater than 4000 but less than 6000
%sql SELECT Distinct(Version_Booster) FROM SPACEXTBL\
    WHERE PayloadMass >4000 and PayloadMass <6000;

 * sqlite:///SpaceX.db
Done.

[('F9 v1.1',),
 ('F9 v1.1B1011',),
 ('F9 v1.1B1016',),
 ('F9 FTB1020',),
 ('F9 FTB1022',),
 ('F9 FTB1026',),
 ('F9 FT B1028',),
 ('F9 FTB1030',),
 ('F9 FT♺',),
 ('F9 B4B1040.1',),
 ('F9 FTB1031.2',),
 ('F9 FTB1032.2',),
 ('F9 B4B1040.2',),
 ('F9 B5B1046.2',),
 ('F9 B5B1054',),
 ('F9 B5B1059.1',)]

In [21]:
#Calculate the total number of successful and failure mission outcomes
%sql SELECT sum(Class) as num_success, sum(Failure) as num_failure FROM SPACEXTBL;

 * sqlite:///SpaceX.db
Done.

[(133, 35)]

In [13]:
#List the names of the booster which have carried the maximum payload mass
%sql SELECT Distinct(Version_Booster), max(PayloadMass) as max_PayloadMass FROM SPACEXTBL\
        Group By Version_Booster\
        Having max_PayloadMass = 15600;

 * sqlite:///SpaceX.db
Done.

[('F9 B5', 15600),
 ('F9 B5B1049.10', 15600),
 ('F9 B5B1049.6', 15600),
 ('F9 B5B1049.7', 15600),
 ('F9 B5B1049.8', 15600),
 ('F9 B5B1049.9', 15600),
 ('F9 B5B1051.10', 15600),
 ('F9 B5B1051.6', 15600),
 ('F9 B5B1051.8', 15600),
 ('F9 B5B1058.3', 15600),
 ('F9 B5B1058.6', 15600),
 ('F9 B5B1060.2', 15600),
 ('F9 B5B1060.5', 15600),
 ('F9 B5B1060.6', 15600),
 ('F9 B5B1060.7', 15600)]

In [14]:
%sql SELECT Distinct(Version_Booster), max(PayloadMass) as max_PayloadMass FROM SPACEXTBL\
        Group by Version_Booster\
        Having PayloadMass = (SELECT max(PayloadMass) as max_PayloadMass FROM SPACEXTBL);

 * sqlite:///SpaceX.db
Done.

[('F9 B5', 15600),
 ('F9 B5B1049.10', 15600),
 ('F9 B5B1049.6', 15600),
 ('F9 B5B1049.7', 15600),
 ('F9 B5B1049.8', 15600),
 ('F9 B5B1049.9', 15600),
 ('F9 B5B1051.10', 15600),
 ('F9 B5B1051.6', 15600),
 ('F9 B5B1051.8', 15600),
 ('F9 B5B1058.3', 15600),
 ('F9 B5B1058.6', 15600),
 ('F9 B5B1060.2', 15600),
 ('F9 B5B1060.5', 15600),
 ('F9 B5B1060.6', 15600),
 ('F9 B5B1060.7', 15600)]

In [22]:
#List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015
%sql SELECT Date, Outcome, Version_Booster, LaunchSite FROM SPACEXTBL\
        where Date like '2015%' and (Outcome like 'Failure (Drone Ship)');

 * sqlite:///SpaceX.db
Done.

[('2015-01-10', 'Failure (Drone Ship)', 'F9 v1.1B1012', 'Cape Canaveral'),
 ('2015-04-14', 'Failure (Drone Ship)', 'F9 v1.1B1015', 'Cape Canaveral'),
 ('2015-06-28', 'Failure (Drone Ship)', 'F9 v1.1B1018', 'Cape Canaveral')]

In [16]:
#Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order
%sql SELECT Outcome, Count(Outcome) as Outcome_Cnt FROM SPACEXTBL\
        Group by Outcome\
        Having Date Between '2010-06-04' and '2017-03-20'\
        Order by Outcome_Cnt Desc;

 * sqlite:///SpaceX.db
Done.

[('Success (Drone Ship)', 109),
 ('Success (Ground Pad)', 23),
 ('Failure (None)', 19),
 ('Failure (Drone Ship)', 9),
 ('Failure (Ocean)', 6)]

In [17]:
%sql SELECT * FROM SPACEXTBL\
    where Date = '2015-12-22';

 * sqlite:///SpaceX.db
Done.

[(25, '2015-12-22', 'Orbcomm', 'Falcon 9', 'F9 FTB1019', 'Orbcomm-OG2', 2034, 'Cape Canaveral', 'LEO', 1, 0, 0, 1, 1, -80.577366, 28.5618571, 'Success (Ground Pad)', 'Success', 1.0, 1, 0)]